Repository: alanhe421/notifygo
Catalog: NotifyGo/Resources/Localizable.xcstrings
Source language: en
Languages: ja, ko, zh_hans

source: Allow camera access for NotifyGo in Settings, or paste the code instead.
ja: 設定で NotifyGo のカメラへのアクセスを許可するか、コードを貼り付けてください。
ko: 설정에서 NotifyGo의 카메라 접근을 허용하거나 코드를 붙여 넣으세요.
zh_hans: 请在系统设置中允许 NotifyGo 使用相机，或直接粘贴迁移码。

source: App Language
ja: アプリの言語
ko: 앱 언어
zh_hans: 应用语言

source: Callbacks
ja: コールバック
ko: 콜백
zh_hans: 回调

source: Callbacks, templates, history and the Push URL move here, and the old device is disconnected immediately. URLs saved in App Store Connect and other services keep working.
ja: Callback、テンプレート、履歴、Push URL がこのデバイスに移り、以前のデバイスの接続はすぐに解除されます。App Store Connect などに保存した URL はそのまま使えます。
ko: Callback, 템플릿, 기록 및 Push URL이 이 기기로 옮겨지고 이전 기기는 즉시 연결 해제됩니다. App Store Connect 등에 저장된 URL은 계속 작동합니다.
zh_hans: Callback、模板、历史记录和 Push URL 将转移到本设备，旧设备会立即断开。App Store Connect 及其他服务中保存的 URL 继续有效。

source: Camera unavailable
ja: カメラを使用できません
ko: 카메라를 사용할 수 없음
zh_hans: 相机不可用

source: Cancel
ja: キャンセル
zh_hans: 取消

source: Choose a template
ja: テンプレートを選択
ko: 템플릿 선택
zh_hans: 选择模板

source: Code expired
ja: コードの有効期限が切れました
ko: 코드가 만료됨
zh_hans: 迁移码已过期

source: Connect to create this device's private Push URL.
ja: 接続すると、このデバイス専用のプッシュURLが作成されます。
zh_hans: 连接后将为此设备创建专属推送 URL。

source: Copied
ja: コピー済み
zh_hans: 已复制

source: Copied to clipboard
ja: クリップボードにコピーしました
zh_hans: 已复制到剪贴板

source: Copy Device Token
ja: デバイストークンをコピー
zh_hans: 复制设备令牌

source: Copy migration code
ja: 移行コードをコピー
ko: 이전 코드 복사
zh_hans: 复制迁移码

source: Copy Push URL
ja: プッシュURLをコピー
zh_hans: 复制推送 URL

source: Create a new code to continue.
ja: 続けるには新しいコードを作成してください。
ko: 계속하려면 새 코드를 만드세요.
zh_hans: 请生成新的迁移码后继续。

source: Create Callback
ja: コールバックを作成
zh_hans: 创建回调

source: Create new code
ja: 新しいコードを作成
ko: 새 코드 만들기
zh_hans: 生成新迁移码

source: Creates a Callback from this template
ja: このテンプレートからコールバックを作成します
ko: 이 템플릿으로 콜백을 만듭니다
zh_hans: 使用此模板创建回调

source: cURL Example
ja: cURLの例
zh_hans: cURL 示例

source: Customize
ja: カスタマイズ
zh_hans: 自定义

source: Customize notification
ja: 通知をカスタマイズ
zh_hans: 自定义通知

source: Default
ja: デフォルト
zh_hans: 默认

source: Device Migration
ja: デバイスの移行
ko: 기기 이전
zh_hans: 设备迁移

source: Device Push URL
ja: デバイスのプッシュURL
ko: 기기 푸시 URL
zh_hans: 设备推送 URL

source: Device Security
ja: デバイスのセキュリティ
ko: 기기 보안
zh_hans: 设备安全

source: Device Token
ja: デバイストークン
ko: 기기 토큰
zh_hans: 设备令牌

source: Done
ja: 完了
zh_hans: 完成

source: Enable notifications
ja: 通知を有効にする
zh_hans: 启用通知

source: Enabled
ja: 有効
ko: 활성화됨
zh_hans: 已启用

source: Expires %@. Anyone with this code can take over your Callbacks, so only use it on your own device.
ja: %@に期限切れになります。このコードを持つ人は誰でも Callback を引き継げるため、自分のデバイスでのみ使用してください。
ko: %@ 만료됩니다. 이 코드를 가진 사람은 누구나 Callback을 가져갈 수 있으므로 본인 기기에서만 사용하세요.
zh_hans: %@后过期。任何拿到此迁移码的人都能接管你的 Callback，请只在自己的设备上使用。

source: Follow System
ja: システム設定に従う
ko: 시스템 설정 따르기
zh_hans: 跟随系统

source: Generic Webhook
ja: 汎用 Webhook
ko: 일반 Webhook
zh_hans: 通用 Webhook

source: History
ja: 履歴
ko: 기록
zh_hans: 历史

source: History unavailable
ja: 履歴を利用できません
zh_hans: 历史记录不可用

source: Home
ja: ホーム
ko: 홈
zh_hans: 首页

source: Language
ja: 言語
ko: 언어
zh_hans: 语言

source: Migrate
ja: 移行
ko: 이전
zh_hans: 迁移

source: Migrate from Another Device
ja: 別のデバイスから移行
ko: 다른 기기에서 이전
zh_hans: 从其他设备迁移

source: Migrate to This Device
ja: このデバイスへ移行
ko: 이 기기로 이전
zh_hans: 迁移到本设备

source: Migrate to this device?
ja: このデバイスへ移行しますか？
ko: 이 기기로 이전할까요?
zh_hans: 迁移到本设备？

source: Migration code
ja: 移行コード
ko: 이전 코드
zh_hans: 迁移码

source: Migration code copied
ja: 移行コードをコピーしました
ko: 이전 코드가 복사됨
zh_hans: 迁移码已复制

source: Migration complete
ja: 移行が完了しました
ko: 이전 완료
zh_hans: 迁移完成

source: Migration QR code
ja: 移行用 QR コード
ko: 이전용 QR 코드
zh_hans: 迁移二维码

source: Move to a New Device
ja: 新しいデバイスへ移行
ko: 새 기기로 이전
zh_hans: 迁移到新设备

source: Moves your Callbacks, templates, history and Push URL to another device. URLs in App Store Connect and other services stay the same.
ja: Callback、テンプレート、履歴、Push URL を別のデバイスへ移行します。App Store Connect などに設定した URL は変わりません。
ko: Callback, 템플릿, 기록 및 Push URL을 다른 기기로 옮깁니다. App Store Connect 등 다른 서비스의 URL은 그대로 유지됩니다.
zh_hans: 将 Callback、模板、历史记录和 Push URL 转移到另一台设备。App Store Connect 及其他服务中的 URL 无需修改。

source: New
ja: 新規
zh_hans: 新建

source: No Callbacks yet
ja: コールバックはまだありません
zh_hans: 暂无回调

source: No notifications yet
ja: 通知はまだありません
ko: 아직 알림이 없습니다
zh_hans: 暂无通知

source: None
ja: なし
zh_hans: 无

source: Not enabled
ja: 無効
zh_hans: 未启用

source: Notification
ja: 通知
zh_hans: 通知

source: Notifications
ja: 通知
ko: 알림
zh_hans: 通知

source: Notifications sent by your Callbacks will appear here.
ja: コールバックから送信された通知がここに表示されます。
zh_hans: 由回调发送的通知会显示在这里。

source: On the new device, open NotifyGo → Settings → Migrate from Another Device, then scan this code.
ja: 新しいデバイスで NotifyGo → 設定 → 別のデバイスから移行 を開き、このコードをスキャンしてください。
ko: 새 기기에서 NotifyGo → 설정 → 다른 기기에서 이전을 열고 이 코드를 스캔하세요.
zh_hans: 在新设备上打开 NotifyGo → 设置 → 从其他设备迁移，然后扫描此二维码。

source: On your old device, open NotifyGo → Settings → Move to a New Device.
ja: 以前のデバイスで NotifyGo → 設定 → 新しいデバイスへ移行 を開いてください。
ko: 이전 기기에서 NotifyGo → 설정 → 새 기기로 이전을 여세요.
zh_hans: 在旧设备上打开 NotifyGo → 设置 → 迁移到新设备。

source: Open notification settings
ja: 通知設定を開く
zh_hans: 打开通知设置

source: Quick Push
ja: クイックプッシュ
ko: 빠른 푸시
zh_hans: 快捷推送

source: Reset Device Key
ja: デバイスキーをリセット
ko: 기기 키 재설정
zh_hans: 重置设备密钥

source: Reset Device Key?
ja: デバイスキーをリセットしますか？
zh_hans: 要重置设备密钥吗？

source: Reset Key
ja: キーをリセット
zh_hans: 重置密钥

source: Retry
ja: 再試行
ko: 다시 시도
zh_hans: 重试

source: Scan QR Code
ja: QR コードをスキャン
ko: QR 코드 스캔
zh_hans: 扫描二维码

source: Send
ja: 送信
zh_hans: 发送

source: Send directly to this device
ja: このデバイスに直接送信
ko: 이 기기로 바로 보내기
zh_hans: 直接发送到此设备

source: Send Test to This Device
ja: このデバイスにテスト送信
zh_hans: 向此设备发送测试

source: Settings
ja: 設定
ko: 설정
zh_hans: 设置

source: Sound
ja: サウンド
zh_hans: 声音

source: Start with the payload and notification rules that fit your source.
ja: 送信元に適したペイロードと通知ルールから始めます。
ko: 소스에 맞는 페이로드와 알림 규칙으로 시작하세요.
zh_hans: 从适合该来源的请求数据和通知规则开始。

source: Status
ja: 状態
ko: 상태
zh_hans: 状态

source: Test
ja: テスト
zh_hans: 测试

source: The current Push URL will stop working immediately. Callback URLs are not affected.
ja: 現在のプッシュURLは直ちに無効になります。コールバックURLには影響しません。
zh_hans: 当前推送 URL 将立即失效，回调 URL 不受影响。

source: The Device Token will appear after notification registration completes.
ja: 通知の登録が完了するとデバイストークンが表示されます。
zh_hans: 通知注册完成后会显示设备令牌。

source: This APNs token identifies this app installation. Treat it as diagnostic information and avoid sharing it publicly.
ja: このAPNsトークンは本アプリのインストールを識別します。診断情報として扱い、公開しないでください。
zh_hans: 此 APNs 令牌用于标识本次应用安装。请将其视为诊断信息，不要公开分享。

source: This device already has Callbacks. Delete them before migrating, or migrate to a device without Callbacks.
ja: このデバイスには既に Callback があります。移行前に削除するか、Callback のないデバイスへ移行してください。
ko: 이 기기에 이미 Callback이 있습니다. 이전하기 전에 삭제하거나 Callback이 없는 기기로 이전하세요.
zh_hans: 本设备已有 Callback。请先删除，或迁移到没有 Callback 的设备。

source: Turn a JSON payload or App Store event into a notification.
ja: JSONペイロードやApp Storeイベントを通知に変換します。
zh_hans: 将 JSON 数据或 App Store 事件转换为通知。

source: Turn any JSON POST request into a notification with field mappings and rules.
ja: フィールドマッピングとルールを使って、任意のJSON POSTリクエストを通知に変換します。
ko: 필드 매핑과 규칙을 사용해 모든 JSON POST 요청을 알림으로 변환합니다.
zh_hans: 通过字段映射和规则，将任意 JSON POST 请求转换成通知。

source: Verify App Store Server Notifications and start with transaction-ready fields and rules.
ja: App Store Server Notificationsを検証し、取引用のフィールドとルールから始めます。
ko: App Store 서버 알림을 검증하고 거래용 필드와 규칙으로 시작합니다.
zh_hans: 验证 App Store 服务器通知，并使用预置的交易字段和规则。

source: Your Callbacks, templates, history and Push URL are now on this device. Existing URLs keep working.
ja: Callback、テンプレート、履歴、Push URL はこのデバイスに移りました。既存の URL はそのまま使えます。
ko: Callback, 템플릿, 기록 및 Push URL이 이 기기로 옮겨졌습니다. 기존 URL은 계속 작동합니다.
zh_hans: Callback、模板、历史记录和 Push URL 已转移到本设备，现有 URL 继续有效。

source: Your Callbacks, templates, history and Push URL now belong to the new device. This device has been disconnected.
ja: Callback、テンプレート、履歴、Push URL は新しいデバイスに移りました。このデバイスの接続は解除されました。
ko: Callback, 템플릿, 기록 및 Push URL이 새 기기로 옮겨졌습니다. 이 기기는 연결이 해제되었습니다.
zh_hans: Callback、模板、历史记录和 Push URL 已归属新设备，本设备已断开连接。
